{
    "1768151250": {
        "url": "https://www.vibekanban.com/vibe-guide",
        "title": "Vibe Guide",
        "quote": "Tips and best practices for working with AI coding agents. Honestly, we don't have consensus at Vibe Kanban HQ for how to work with coding agents - everyone uses different tools, in different ways. This is just how Louis does it.",
        "note": "AI era of software starts here."
    },
    "1767993521": {
        "url": "https://www.mihaileric.com/The-Emperor-Has-No-Clothes/",
        "title": "How to code Claude Code in 200 lines of code",
        "quote": "But the core loop? It’s exactly what we built here. The LLM decides what to do, your code executes it, results flow back. That’s the whole architecture.",
        "note": ""
    },
    "1614635375": {
        "url": "https://fs.blog/2021/03/thinking-rate-fixed/",
        "title": "Your thinking rate is fixed",
        "quote": "You can’t force yourself to think faster. If you try, you’re likely to end up making much worse decisions.",
        "note": "The more you think about a problem the faster you solve it."
    },
    "1613569694": {
        "url": "https://pythonnumericalmethods.berkeley.edu/notebooks/Index.html",
        "title": "A guide for engineers and scientists",
        "quote": "Because programming has become an essential component of engineering, science, medicine, media, business, finance, and many other fields, it is important for scientists and engineers to have a basic foundation in computer programming to be competitive.",
        "note": ""
    },
    "1597358680": {
        "url": "http://russianliteratureandbiography.com/505/",
        "title": "Tolstoy’s coding advice",
        "quote": "You should only code when you feel within you some completely new and important idea, clear to you but unintelligible to others, and when the need to express this idea gives you no peace.",
        "note": "(code, idea) = (write, content)"
    },
    "1595804327": {
        "url": "https://www.anup.io/2020/07/20/invert-always-invert/",
        "title": "Invert, always, invert",
        "quote": "...it is in the nature of things that many hard problems are best solved when they are addressed backward.",
        "note": "\"It is remarkable how much long-term advantage people like us have gotten by trying to be consistently not stupid, instead of trying to be very intelligent.\" — Charlie Munger"
    },
    "1594238667": {
        "url": "https://en.wikipedia.org/wiki/I_Am_a_Strange_Loop",
        "title": "I am a strange loop",
        "quote": "In the end, we are self-perceiving, self-inventing, locked-in mirages that are little miracles of self-reference.",
        "note": "Future is defined by things we want to improve from our past."
    },
    "1593410332": {
        "url": "https://deniseyu.io/2020/05/23/habits-of-high-performing-teams.html",
        "title": "Habits of high-functioning teams",
        "quote": "Our communications with each other should be guided by the robustness principle: Be conservative in what you send, be liberal in what you accept.",
        "note": ""
    },
    "1591921895": {
        "url": "https://michaelfeathers.silvrback.com/functional-code-is-honest-code",
        "title": "Functional code is honest code",
        "quote": "That’s the goal, really. Simplify understanding. No surprises. Honest code.",
        "note": "Output depends only on input."
    },
    "1583351314": {
        "url": "https://findwork.dev/blog/advanced-usage-python-requests-timeouts-retries-hooks/",
        "title": "Advanced usage of requests",
        "quote": "BaseUrlSession allows you to specify the base URL for the HTTP client and to only specify the resource path at the time of the request.",
        "note": "The opposite of requests is Falcon which lets you speak HTTP."
    },
    "1571689715": {
        "url": "https://www.oreilly.com/learning/hadoop-with-python",
        "title": "Hadoop with Python",
        "quote": "Spark can read files residing on the local filesystem, any storage source supported by Hadoop, Amazon S3, and so on. Spark supports text files, SequenceFiles, any other Hadoop Input‐ Format, directories, compressed files and wildcards.",
        "note": "I should I knew Spark can read compressed gigabyte CSVs."
    },
    "1569830154": {
        "url": "https://martinheinz.dev/blog/1",
        "title": "Python tips and tricks you haven't seen",
        "quote": "I want to note that all those features are part of Python standard library, so whenever you decide to implement something in Python first go looking for it in standard library.",
        "note": "Improve performance of your Python program."
    },
    "1564172032": {
        "url": "https://teddymarchildon.com/blog/1",
        "title": "Recreating Keras from scratch",
        "quote": "Understanding generic neural networks by building the popular AI library Keras using base Python.",
        "note": "I need to write this myself."
    },
    "1557921035": {
        "url": "https://datawhatnow.com/things-you-are-probably-not-using-in-python-3-but-should/",
        "title": "Things you're probably not using in Python 3",
        "quote": "Examples of exciting features you can only use in Python 3 in the hopes that it will make solving your problems with Python easier.",
        "note": ""
    },
    "1557920667": {
        "url": "https://www.japantimes.co.jp/news/2019/05/14/national/japan-plans-create-10-billion-14-digit-phone-numbers-5g-era-approaching/",
        "title": "Japan plans to create 10 billion 14-digit phone numbers",
        "quote": "With the commercialization of the fifth-generation, or 5G, of superfast mobile communication format approaching, 11-digit numbers are expected to run out as early as fiscal 2022.",
        "note": "What's wrong with case insensitive letters? US-ABC-900-900 can be a beautiful phone number and global. 165,216,101,262,848 phone numbers per country."
    },
    "1557338893": {
        "url": "http://ryanflorence.com/deploying-websites-with-a-tiny-git-hook/",
        "title": "Deploying websites with a tiny git hook",
        "quote": "Hooks?! Hooks are scripts that git will execute when awesome stuff happens, like after the repository receives a push.",
        "note": ""
    },
    "1550069992": {
        "url": "https://www.davidfischer.name/2017/01/python-command-line-apps/",
        "title": "Python command line apps",
        "quote": "There are a number of Python libraries and modules to help build a command line app from parsing arguments and options to testing to full blown CLI frameworks which handle things like colorized output, progress bars, sending email or pluggable modules.",
        "note": ""
    },
    "1547633518": {
        "url": "https://python-3-patterns-idioms-test.readthedocs.io/en/latest/PythonDecorators.html",
        "title": "Python decorators with arguments",
        "quote": "The return value of the decorator function must be a function used to wrap the function to be decorated. That is, Python will take the returned function and call it at decoration time, passing the function to be decorated.",
        "note": "Helped me turn any method in a managed task."
    },
    "1546532416": {
        "url": "https://niallburkley.com/blog/index-columns-for-like-in-postgres/",
        "title": "Index columns for LIKE in PostgreSQL",
        "quote": "Postgres uses trigrams to break down strings into smaller chunks and index them efficiently. The pg_trgm module supports GIST or GIN indexes and as of Postgres version 9.1 these indexes support LIKE/ILIKE queries.",
        "note": "I need to test if gin_trgm_ops is faster than varchar_pattern_ops."
    },
    "1543930067": {
        "url": "https://sourcemaking.com",
        "title": "Source making!",
        "quote": "Design patterns can speed up the development process by providing tested, proven development paradigms.",
        "note": "How to shape the source code."
    },
    "1543501003": {
        "url": "https://docs.quantifiedcode.com/python-anti-patterns/index.html",
        "title": "Python anti-patterns",
        "quote": "We think that you can learn as much from reading bad code as you can from reading good one.",
        "note": ""
    },
    "1539807240": {
        "url": "https://www.brynmawr.edu/cs/resources/beauty-of-programming",
        "title": "The beauty of programming",
        "quote": "You can do something the brute force way, the stupid way, or you can find the right approach and suddenly the problem just goes away. You look at the problem another way, and you have this epiphany: it was only a problem because you were looking at it the wrong way.",
        "note": "Less is more. Design the code, design everything."
    },
    "1538656228": {
        "url": "https://sebastianraschka.com/Articles/2014_multiprocessing.html",
        "title": "Multiprocessing in Python",
        "quote": "A brief overview of different approaches to show how the multiprocessing module can be used for parallel programming.",
        "note": ""
    },
    "1537192666": {
        "url": "https://commoncog.com/blog/so-good-they-cant-ignore-you/",
        "title": "So good they can't ignore you",
        "quote": "Following your passion is bad, instead go for Mastery, Autonomy and Purpose — the trio of things that have been proven to motivate knowledge workers.",
        "note": ""
    },
    "1536453455": {
        "url": "http://michal.karzynski.pl/blog/2010/10/19/run-multiple-websites-one-django-project/",
        "title": "How to run multiple websites from one Django project",
        "quote": "The subdomain specific settings files will inherit all the defaults from the common settings.py file, and override only those values which are specific to the domain.",
        "note": "WSGI app files are the key of running multiple subdomains."
    },
    "1536161274": {
        "url": "https://thorstenball.com/blog/2018/09/04/the-tools-i-use-to-write-books/",
        "title": "The tools I use to write books",
        "quote": "Of course I do not send plain text files out to readers. Instead, they receive nicely formatted PDF, ePub, Mobi and HTML files, which I create with only a tiny number of tools: pp, pandoc and KindleGen. Together they form a pipeline.",
        "note": "That pipeline is essential."
    },
    "1530277904": {
        "url": "http://explained.ai/matrix-calculus/index.html",
        "title": "Matrix calculus for deep learning",
        "quote": "This paper is an attempt to explain all the matrix calculus you need in order to understand the training of deep neural networks.",
        "note": ""
    },
    "1530019905": {
        "url": "https://realpython.com/django-and-ajax-form-submissions/",
        "title": "Django and AJAX form submissions",
        "quote": "Say goodbye to the page refresh.",
        "note": ""
    },
    "1523738409": {
        "url": "https://digest.bps.org.uk/2015/12/21/what-kinds-of-actions-do-people-think-of-as-most-stupid/",
        "title": "What is stupid?",
        "quote": "The researchers deduced that there are three main categories of what people consider to be stupidity: confident ignorance, lack of control and lack of practicality.",
        "note": ""
    },
    "1522141329": {
        "url": "https://nautil.us/blog/-the-key-to-good-luck-is-an-open-mind",
        "title": "The key to good luck is an open mind",
        "quote": "Richard Wiseman turned his findings into a luck school where people could learn luck-inducing techniques based on four main principles of luck: maximizing chance opportunities, listening to your intuition, expecting good fortune, and turning bad luck to good.",
        "note": "Keep looking."
    },
    "1517090391": {
        "url": "https://robin.github.io/cocoa/mac/2016/03/28/title-bar-and-toolbar-showcase/",
        "title": "NSWindow title bar and toolbar showcase",
        "quote": "I built a showcase for several combinations of styles of title bar and toolbar of NSWindow. Just to serve as a note of everything I want to remember about the NSWindow styles.",
        "note": ""
    },
    "1517090130": {
        "url": "https://iamtrask.github.io/2015/07/12/basic-python-network/",
        "title": "A neural network in 11 lines of Python",
        "quote": "A bare bones neural network implementation to describe the inner workings of backpropagation.",
        "note": ""
    },
    "1513449582": {
        "url": "http://www.eriktrautman.com/posts/grit-is-a-muscle-train-it",
        "title": "Grit is a muscle, train it",
        "quote": "It's the ability to do hard things regardless of whether the environment is supportive, and it's the ability to maintain determination and motivation for long term goals through all the shit work between now and then.",
        "note": ""
    },
    "1512808371": {
        "url": "http://phrontistery.info/ihlstart.html",
        "title": "Dictionary of unusual words",
        "quote": "I have compiled a list of 17,000 English words, ranging from merely uncommon words to the rarest of the rare words, nearly obsolete and just plain nutty! Each word is listed along with a brief, one-line definition. You should be able to get the general sense of most words, without having to read through pages of dictionary definitions.",
        "note": ""
    },
    "1503309798": {
        "url": "https://zellwk.com/blog/think/",
        "title": "Think like a programmer",
        "quote": "I don't get JavaScript. I can't make components from scratch. My mind goes blank when I stare at a blank JavaScript file. I guess I can't do it because I don't know how to think like a programmer.",
        "note": "Break things down into small logical problems."
    },
    "1502058043": {
        "url": "http://drhyman.com/blog/2011/02/11/do-milk-and-sugar-cause-acne/",
        "title": "Do milk and sugar cause acne?",
        "quote": "But the dietary influences don't stop there. It is not just sugar, but the bad fats we eat that may also contribute to acne.",
        "note": "Lots of ways to help fight acne."
    },
    "1497816161": {
        "url": "https://www.kaoruk.com/posts/06-18-2017-tuning-postgresql-queries",
        "title": "Tuning PostgreSQL queries",
        "quote": "There are no hard and fast rules when it comes to optimizing sql queries.",
        "note": ""
    },
    "1496011659": {
        "url": "https://www.ibm.com/developerworks/linux/library/l-tip-prompt/",
        "title": "Prompt magic",
        "quote": "Enhancing the system prompt",
        "note": ""
    },
    "1495732106": {
        "url": "https://hbr.org/2017/05/dont-spend-your-life-making-up-your-mind",
        "title": "What are you worth?",
        "quote": "And there will come a day when you would give everything you have left to have what you have right now.",
        "note": ""
    },
    "1494621252": {
        "url": "https://kierantie.com/a/burnout/",
        "title": "Recovering from burnout",
        "quote": "In book, The Truth About Burnout, they outline six major imbalances between employees and their work that often lead to burnout. (...) You don't need to have a serious mismatch in all six of these areas to be at risk. In fact, a mismatch in even one area can put you on the path to burnout.",
        "note": ""
    },
    "1493391817": {
        "url": "http://www.swans.com/library/art13/xxx123.html",
        "title": "Say no!",
        "quote": "You. Factory owner. When they tell you tomorrow to make gunpowder instead of baby powder, then there's only one choice: say no!",
        "note": ""
    },
    "1492280715": {
        "url": "http://portaller.com/",
        "title": "Portaller",
        "quote": "DNS and proxy server. Since it is located in NY you can use geo-locked websites in countries outside U.S.",
        "note": "It makes Pithos work."
    },
    "1492178274": {
        "url": "https://forums.macrumors.com/threads/potential-iphone-8-render-shows-vertical-camera-and-rear-touch-id-but-likely-one-of-several-designs.2041636/page-14#post-24495371",
        "title": "Apple's innovation is gone",
        "quote": "They forgot about what made them great in the first place and are totally profit driven. Reminds me of when Steve left Apple years ago. Same crap happened. Almost idenical. He is the new Scully.",
        "note": "Totally agree with this."
    },
    "1491985290": {
        "url": "https://hbr.org/2017/04/a-new-more-rigorous-study-confirms-the-more-you-use-facebook-the-worse-you-feel",
        "title": "The more you use Facebook, the worse you feel",
        "quote": "We found consistently that both liking others' content and clicking links significantly predicted a subsequent reduction in self-reported physical health, mental health, and life satisfaction.",
        "note": "I have to look for this kind of behavior on Sublevel."
    },
    "1491211238": {
        "url": "http://queue.acm.org/detail.cfm?id=3068754",
        "title": "Debugging mindset",
        "quote": "Understanding the psychology of learning strategies leads to effective problem-solving skills.",
        "note": ""
    },
    "1490807743": {
        "url": "http://benchmarksgame.alioth.debian.org",
        "title": "Benchmarks game",
        "quote": "Will your toy benchmark program be faster if you write it in a different programming language? It depends how you write it!",
        "note": "I have to keep an eye on this."
    },
    "1490645297": {
        "url": "http://www.acnemilk.com/the_no_milk_acne_diet",
        "title": "No milk acne diet",
        "quote": "Oil gland pores are plugged by the overproduction of the cells that line the pore. Basically a traffic jam happens in the pore. There are several sources of hormones that cause this overproduction. The first is ovaries or testicles, the second is the adrenal (stress) glands and the third is dairy products.",
        "note": "Stress and milk don't mix up pretty well."
    },
    "1490524417": {
        "url": "https://metacademy.org/roadmaps/rgrosse/learn_on_your_own",
        "title": "How to learn on your own",
        "quote": "In short, this roadmap is really about how to learn specific technical topics that you're interested in. I'll highlight various strategies I've used, as well as resources that I've found useful.",
        "note": "Expand your view."
    },
    "1487941865": {
        "url": "https://awesome-python.com/",
        "title": "Awesome Python",
        "quote": "A curated list of awesome Python frameworks, libraries, software and resources.",
        "note": "Discovered pgcli."
    },
    "1487414288": {
        "url": "http://www.imdb.com/list/ls063257678/",
        "title": "Movies like Netflix's Stranger Things",
        "quote": "Or that inspired it.",
        "note": ""
    },
    "1487156295": {
        "url": "https://code.djangoproject.com/ticket/23816",
        "title": "Ability to defer model field by default",
        "quote": "",
        "note": "Modify get_queryset to use .defer() by default."
    },
    "1487069563": {
        "url": "http://renesd.blogspot.ro/2017/02/is-postgresql-good-enough.html",
        "title": "Is PostgreSQL good enough?",
        "quote": "tldr; you can do jobs, queues, real time change feeds, time series, object store, document store, full text search with PostgreSQL. How to, pros/cons, rough performance and complexity levels are all discussed. Many sources and relevant documentation is linked to.",
        "note": "I need to store avatars from Sublevel in PostgreSQL for consistency but keep serving them with nginx."
    },
    "1487017135": {
        "url": "https://philipwalton.com/articles/the-google-analytics-setup-i-use-on-every-site-i-build/",
        "title": "Google Analytics setup",
        "quote": "Google Analytics is a powerful yet quite complicated tool. And unfortunately, the truth is most people who use it don't reap its full benefits.",
        "note": ""
    },
    "1486988785": {
        "url": "https://certsimple.com/blog/nginx-http2-load-balancing-config",
        "title": "An nginx.conf for 2017",
        "quote": "With HTTP/2 in every browser, load balancing with automatic failover, IPV6, a sorry page, separate blog server, HTML5 SSE and A+ HTTPS.",
        "note": "A good way to separate https.conf from domain.conf files."
    },
    "1485159166": {
        "url": "http://ham-radio.com/k6sti/wifiyagi.htm",
        "title": "Simple Wi-Fi Yagi",
        "quote": "The signal to my wireless adapter card dropped 6 dB when I removed the parasitics from the router dipole. The Yagi provides a fourfold increase in power, which will double the operating range. When signal strength is the limiting factor, it will quadruple throughput.",
        "note": ""
    },
    "1485108047": {
        "url": "http://kevinmahoney.co.uk/articles/django-orm-mistakes/",
        "title": "A few Django ORM mistakes",
        "quote": "See if you can figure out what's wrong with the code snippets below! Ask yourself what the problem is, what effect will it have, and how can you fix it? These examples are for Django, but probably apply to many other ORMs.",
        "note": "I used bug 2 & 3 solutions for Sublevel."
    },
    "1484836205": {
        "url": "https://thecraftymummyblog.wordpress.com/2016/02/06/diy-chocolate-croissants-5-min-prep/",
        "title": "DIY chocolate croissants",
        "quote": "Puff pastry costed €0.99 and I made 10 croissants! Kinder chocolate bars were already home since my eldest child (read: husband) loves them! ",
        "note": "I need to try this as soon as possible."
    },
    "1482771767": {
        "url": "http://hyperpolyglot.org/",
        "title": "Hyperpolyglot",
        "quote": "Programming languages and commonly used features in a side-by-side format.",
        "note": ""
    },
    "1482683452": {
        "url": "http://www.appcoda.com/storyboards-ios-tutorial-pass-data-between-view-controller-with-segue/",
        "title": "Storyboards segue tutorial",
        "quote": "Pass data between view controllers.",
        "note": ""
    },
    "1482615710": {
        "url": "https://golang.org/doc/articles/wiki/",
        "title": "Go apps",
        "quote": "Writing web applications using only the Go Standard Library.",
        "note": ""
    },
    "1482420353": {
        "url": "https://tryolabs.com/blog/2016/12/20/top-10-python-libraries-of-2016/",
        "title": "Top 10 Python libraries of 2016",
        "quote": "Who said Python couldn't be fast? Apart from competing for the best name of a software library ever, Sanic also competes for the fastest Python web framework ever, and appears to be the winner by a clear margin. It is a Flask-like Python 3.5+ web server that is designed for speed.",
        "note": ""
    },
    "1480646268": {
        "url": "https://www.brainpickings.org/2016/08/01/bruce-lee-notebook/",
        "title": "Bruce Lee's writings",
        "quote": "You will never get any more out of life than you expect.",
        "note": ""
    },
    "1480011160": {
        "url": "http://qz.com/580940/toxic-relationship-habits-most-people-think-are-normal/",
        "title": "Toxic relationship habits most people think are normal",
        "quote": "But when it comes down to actually handling the nitty-gritty of relationships, we're given no pointers … or worse, we're given advice columns in women's magazines. Yes, it's trial-and-error from the get-go. And if you're like most people, it's been mostly error.",
        "note": ""
    },
    "1479711480": {
        "url": "http://www.jessyoko.com/blog/2012/11/07/why-startup-founders-are-always-unhappy/",
        "title": "Why startup founders are always unhappy",
        "quote": "My theory is that a founder's happiness is tied to the rate of change of their startup's success. In other words, your happiness graph is the first derivative of your success graph.",
        "note": "I came a long way with Sublevel but I'm still unhappy."
    },
    "1479123462": {
        "url": "https://blog.appdynamics.com/python/a-performance-analysis-of-python-wsgi-servers-part-2/",
        "title": "A performance analysis of Python WSGI servers",
        "quote": "In Part 1 of this series, we introduced you to WSGI and the top 6 WSGI web servers. In this post, we'll show you the result of our performance benchmark analysis of these servers. There are many production-grade WSGI servers, and we were curious as to how well they performed. To this end, we constructed a benchmark to test six of the most popular servers.",
        "note": ""
    },
    "1478558267": {
        "url": "http://www.nytimes.com/2016/07/31/magazine/the-oppressive-gospel-of-minimalism.html",
        "title": "The oppressive gospel of minimalism",
        "quote": "It has become an ostentatious ritual of consumerist self-sacrifice; people who have it all now seem to prefer having nothing at all.",
        "note": ""
    },
    "1478558246": {
        "url": "http://www.jamesaltucher.com/2016/04/minimalism-brought-freedom-joy/",
        "title": "How minimalism brought me freedom and joy",
        "quote": "I have one bag of clothes, one backpack with a computer, iPad, and phone. I have zero other possessions.",
        "note": ""
    },
    "1478509745": {
        "url": "http://nichol.as/benchmark-of-python-web-servers",
        "title": "Benchmark of Python WSGI servers",
        "quote": "So that is what we are going to do, we are going to take the top-3 performing WSGI servers namely Tornado, Gevent and uWSGI (FAPWS3 lack of HTTP/1.1 support made it unsuitable for this benchmark) and give them 5 minutes of ping-pong mayhem.",
        "note": ""
    },
    "1477811141": {
        "url": "https://griffintechnology.com/us/breaksafe-magnetic-usb-c-power-cable",
        "title": "BreakSafe magnetic USB-C power cable",
        "quote": "Use BreakSafe with the USB-C power supply that came with your laptop. BreakSafe is rated up to 60 watts (20 volts @ 3 amps), and has been designed and tested to meet USB-C power standards. Please note that BreakSafe is for charging power only; data and video are not supported.",
        "note": ""
    },
    "1477589408": {
        "url": "http://qz.com/818998/googles-former-happiness-guru-developed-a-three-second-brain-exercise-for-finding-joy/",
        "title": "Three-second brain exercise for finding joy",
        "quote": "Tan's thin slice exercise contains a trigger, a routine, and a reward—the three parts necessary to build a habit. The trigger, he says, is the pleasant moment, the routine is the noticing of it, and the reward is the feeling of joy itself.",
        "note": ""
    },
    "1476818234": {
        "url": "https://www.amazon.com/NOKIA-LUMIA-INCHES-FACTORY-UNLOCKED/dp/B00NOZLUDE/",
        "title": "Nokia Lumia 735",
        "quote": "I can't express to you how nice and solid this phone feels in hand. It's nothing short of spectacular. I don't even use the case I have for it because I don't drop it without the case. I was at first a bit skeptical about build quality because the back cover is removable but the shape and materials look and feel amazing…",
        "note": "This item ships to Romania."
    },
    "1476558622": {
        "url": "https://kext.io/2016/10/03/a-base-filesystem-project/",
        "title": "A base filesystem project",
        "quote": "I've pushed a basic remote macOS filesystem project to GitHub. Its got all the bits and pieces necessary to work but I haven't audited all parts of it for correctness.",
        "note": "I should build a SFTP file system too."
    },
    "1476518064": {
        "url": "http://blog.etianen.com/blog/2013/06/08/django-querysets",
        "title": "Using Django querysets effectively",
        "quote": "To avoid populating the queryset cache, but to still iterate over all your results, use the iterator() method to fetch the data in chunks, and throw away old rows when they've been processed.",
        "note": ""
    },
    "1476517679": {
        "url": "http://www.nytimes.com/2016/10/06/t-magazine/design/brutalist-architecture-revival.html",
        "title": "Brutalism is back",
        "quote": "Brutalism was an attempt to create an architectural ethic, rather than an aesthetic. It had less to do with materials and more to do with honesty: an uncompromising desire to tell it like it is, architecturally speaking.",
        "note": ""
    },
    "1476449146": {
        "url": "https://jamielinux.com/blog/hide-grub-menu-on-fedora/",
        "title": "Hide GRUB menu on Fedora",
        "quote": "GRUB_TIMEOUT=0",
        "note": "GRUB_HIDDEN_TIMEOUT=1"
    }
}