[{"url":"https:\/\/nautil.us\/blog\/-the-key-to-good-luck-is-an-open-mind","title":"The key to good luck is an open mind","quote":"Richard Wiseman turned his findings into a “luck school” where people could learn luck-inducing techniques based on four main principles of luck: maximizing chance opportunities, listening to your intuition, expecting good fortune, and turning bad luck to good.","note":"Keep looking.","created":1522141329},{"url":"https:\/\/robin.github.io\/cocoa\/mac\/2016\/03\/28\/title-bar-and-toolbar-showcase\/","title":"NSWindow title bar and toolbar showcase","quote":"I built a showcase for several combinations of styles of title bar and toolbar of NSWindow. Just to serve as a note of everything I want to remember about the NSWindow styles.","note":"","created":1517090391},{"url":"https:\/\/iamtrask.github.io\/2015\/07\/12\/basic-python-network\/","title":"A neural network in 11 lines of Python","quote":"A bare bones neural network implementation to describe the inner workings of backpropagation.","note":"","created":1517090130},{"url":"http:\/\/www.eriktrautman.com\/posts\/grit-is-a-muscle-train-it","title":"Grit is a muscle, train it","quote":"It's the ability to do hard things regardless of whether the environment is supportive, and it's the ability to maintain determination and motivation for long term goals through all the shit work between now and then.","note":"","created":1513449582},{"url":"http:\/\/phrontistery.info\/ihlstart.html","title":"Dictionary of unusual words","quote":"I have compiled a list of 17,000 English words, ranging from merely uncommon words to the rarest of the rare words, nearly obsolete and just plain nutty! Each word is listed along with a brief, one-line definition. You should be able to get the general sense of most words, without having to read through pages of dictionary definitions.","note":"","created":1512808371},{"url":"https:\/\/zellwk.com\/blog\/think\/","title":"Think like a programmer","quote":"I don’t get JavaScript. I can’t make components from scratch. My mind goes blank when I stare at a blank JavaScript file. I guess I can’t do it because I don’t know how to think like a programmer.","note":"Break things down into small logical problems.","created":1503309798},{"url":"http:\/\/drhyman.com\/blog\/2011\/02\/11\/do-milk-and-sugar-cause-acne\/","title":"Do milk and sugar cause acne?","quote":"But the dietary influences don’t stop there. It is not just sugar, but the bad fats we eat that may also contribute to acne.","note":"Lots of ways to help fight acne.","created":1502058043},{"url":"https:\/\/www.kaoruk.com\/posts\/06-18-2017-tuning-postgresql-queries","title":"Tuning PostgreSQL queries","quote":"There are no hard and fast rules when it comes to optimizing sql queries.","note":"","created":1497816161},{"url":"https:\/\/www.ibm.com\/developerworks\/linux\/library\/l-tip-prompt\/","title":"Prompt magic","quote":"Enhancing the system prompt","note":"","created":1496011659},{"url":"https:\/\/hbr.org\/2017\/05\/dont-spend-your-life-making-up-your-mind","title":"What are you worth?","quote":"And there will come a day when you would give everything you have left to have what you have right now.","note":"","created":1495732106},{"url":"https:\/\/kierantie.com\/a\/burnout\/","title":"Recovering from burnout","quote":"In book, The Truth About Burnout, they outline six major imbalances between employees and their work that often lead to burnout. (…) You don’t need to have a serious mismatch in all six of these areas to be at risk. In fact, a mismatch in even one area can put you on the path to burnout.","note":"","created":1494621252},{"url":"http:\/\/www.swans.com\/library\/art13\/xxx123.html","title":"Say no!","quote":"You. Factory owner. When they tell you tomorrow to make gunpowder instead of baby powder, then there's only one choice: say no!","note":"","created":1493391817},{"url":"http:\/\/portaller.com\/","title":"Portaller","quote":"DNS and proxy server. Since it is located in NY you can use geo-locked websites in countries outside U.S.","note":"It makes Pithos work.","created":1492280715},{"url":"https:\/\/forums.macrumors.com\/threads\/potential-iphone-8-render-shows-vertical-camera-and-rear-touch-id-but-likely-one-of-several-designs.2041636\/page-14#post-24495371","title":"Apple's innovation is gone","quote":"They forgot about what made them great in the first place and are totally profit driven. Reminds me of when Steve left Apple years ago. Same crap happened. Almost idenical. He is the new Scully.","note":"Totally agree with this.","created":1492178274},{"url":"https:\/\/hbr.org\/2017\/04\/a-new-more-rigorous-study-confirms-the-more-you-use-facebook-the-worse-you-feel","title":"The more you use Facebook, the worse you feel","quote":"We found consistently that both liking others’ content and clicking links significantly predicted a subsequent reduction in self-reported physical health, mental health, and life satisfaction.","note":"I have to look for this kind of behavior on Sublevel.","created":1491985290},{"url":"http:\/\/queue.acm.org\/detail.cfm?id=3068754","title":"Debugging mindset","quote":"Understanding the psychology of learning strategies leads to effective problem-solving skills.","note":"","created":1491211238},{"url":"http:\/\/benchmarksgame.alioth.debian.org","title":"Benchmarks game","quote":"Will your toy benchmark program be faster if you write it in a different programming language? It depends how you write it!","note":"I have to keep an eye on this.","created":1490807743},{"url":"http:\/\/www.acnemilk.com\/the_no_milk_acne_diet","title":"No milk acne diet","quote":"Oil gland pores are plugged by the overproduction of the cells that line the pore. Basically a \"traffic jam\" happens in the pore. There are several sources of hormones that cause this overproduction. The first is ovaries or testicles, the second is the adrenal (stress) glands and the third is dairy products.","note":"Stress and milk don’t mix up pretty well.","created":1490645297},{"url":"https:\/\/metacademy.org\/roadmaps\/rgrosse\/learn_on_your_own","title":"How to learn on your own","quote":"In short, this roadmap is really about how to learn specific technical topics that you're interested in. I'll highlight various strategies I've used, as well as resources that I've found useful.","note":"Expand your view.","created":1490524417},{"url":"https:\/\/awesome-python.com\/","title":"Awesome Python","quote":"A curated list of awesome Python frameworks, libraries, software and resources.","note":"Discovered pgcli.","created":1487941865},{"url":"http:\/\/www.imdb.com\/list\/ls063257678\/","title":"Movies like Netflix's Stranger Things","quote":"Or that inspired it.","note":"","created":1487414288},{"url":"https:\/\/code.djangoproject.com\/ticket\/23816","title":"Ability to defer model field by default","quote":"","note":"Modify get_queryset to use .defer() by default.","created":1487156295},{"url":"http:\/\/renesd.blogspot.ro\/2017\/02\/is-postgresql-good-enough.html","title":"Is PostgreSQL good enough?","quote":"tldr; you can do jobs, queues, real time change feeds, time series, object store, document store, full text search with PostgreSQL. How to, pros\/cons, rough performance and complexity levels are all discussed. Many sources and relevant documentation is linked to.","note":"I need to store avatars from Sublevel in PostgreSQL for consistency but keep serving them with nginx.","created":1487069563},{"url":"https:\/\/philipwalton.com\/articles\/the-google-analytics-setup-i-use-on-every-site-i-build\/","title":"Google Analytics setup","quote":"Google Analytics is a powerful yet quite complicated tool. And unfortunately, the truth is most people who use it don’t reap its full benefits.","note":"","created":1487017135},{"url":"https:\/\/certsimple.com\/blog\/nginx-http2-load-balancing-config","title":"An nginx.conf for 2017","quote":"With HTTP\/2 in every browser, load balancing with automatic failover, IPV6, a sorry page, separate blog server, HTML5 SSE and A+ HTTPS.","note":"A good way to separate https.conf from domain.conf files.","created":1486988785},{"url":"http:\/\/ham-radio.com\/k6sti\/wifiyagi.htm","title":"Simple Wi-Fi Yagi","quote":"The signal to my wireless adapter card dropped 6 dB when I removed the parasitics from the router dipole. The Yagi provides a fourfold increase in power, which will double the operating range. When signal strength is the limiting factor, it will quadruple throughput.","note":"","created":1485159166},{"url":"http:\/\/kevinmahoney.co.uk\/articles\/django-orm-mistakes\/","title":"A few Django ORM mistakes","quote":"See if you can figure out what's wrong with the code snippets below! Ask yourself what the problem is, what effect will it have, and how can you fix it? These examples are for Django, but probably apply to many other ORMs.","note":"I used bug 2 & 3 solutions for Sublevel.","created":1485108047},{"url":"https:\/\/thecraftymummyblog.wordpress.com\/2016\/02\/06\/diy-chocolate-croissants-5-min-prep\/","title":"DIY chocolate croissants","quote":"Puff pastry costed €0.99 and I made 10 croissants! Kinder chocolate bars were already home since my eldest child (read: husband) loves them! ","note":"I need to try this as soon as possible.","created":1484836205},{"url":"http:\/\/hyperpolyglot.org\/","title":"Hyperpolyglot","quote":"Programming languages and commonly used features in a side-by-side format.","note":"","created":1482771767},{"url":"http:\/\/www.appcoda.com\/storyboards-ios-tutorial-pass-data-between-view-controller-with-segue\/","title":"Storyboards segue tutorial","quote":"Pass data between view controllers.","note":"","created":1482683452},{"url":"https:\/\/golang.org\/doc\/articles\/wiki\/","title":"Go apps","quote":"Writing web applications using only the Go Standard Library.","note":"","created":1482615710},{"url":"https:\/\/tryolabs.com\/blog\/2016\/12\/20\/top-10-python-libraries-of-2016\/","title":"Top 10 Python libraries of 2016","quote":"Who said Python couldn’t be fast? Apart from competing for the best name of a software library ever, Sanic also competes for the fastest Python web framework ever, and appears to be the winner by a clear margin. It is a Flask-like Python 3.5+ web server that is designed for speed.","note":"","created":1482420353},{"url":"https:\/\/www.brainpickings.org\/2016\/08\/01\/bruce-lee-notebook\/","title":"Bruce Lee’s writings","quote":"You will never get any more out of life than you expect.","note":"","created":1480646268},{"url":"http:\/\/qz.com\/580940\/toxic-relationship-habits-most-people-think-are-normal\/","title":"Toxic relationship habits most people think are normal","quote":"But when it comes down to actually handling the nitty-gritty of relationships, we’re given no pointers … or worse, we’re given advice columns in women’s magazines. Yes, it’s trial-and-error from the get-go. And if you’re like most people, it’s been mostly error.","note":"","created":1480011160},{"url":"http:\/\/www.jessyoko.com\/blog\/2012\/11\/07\/why-startup-founders-are-always-unhappy\/","title":"Why startup founders are always unhappy","quote":"My theory is that a founder’s happiness is tied to the rate of change of their startup’s success. In other words, your happiness graph is the first derivative of your success graph.","note":"I came a long way with Sublevel but I’m still unhappy.","created":1479711480},{"url":"https:\/\/blog.appdynamics.com\/python\/a-performance-analysis-of-python-wsgi-servers-part-2\/","title":"A performance analysis of Python WSGI servers","quote":"In Part 1 of this series, we introduced you to WSGI and the top 6 WSGI web servers. In this post, we’ll show you the result of our performance benchmark analysis of these servers. There are many production-grade WSGI servers, and we were curious as to how well they performed. To this end, we constructed a benchmark to test six of the most popular servers.","note":"","created":1479123462},{"url":"http:\/\/www.nytimes.com\/2016\/07\/31\/magazine\/the-oppressive-gospel-of-minimalism.html","title":"The oppressive gospel of minimalism","quote":"It has become an ostentatious ritual of consumerist self-sacrifice; people who have it all now seem to prefer having nothing at all.","note":"","created":1478558267},{"url":"http:\/\/www.jamesaltucher.com\/2016\/04\/minimalism-brought-freedom-joy\/","title":"How minimalism brought me freedom and joy","quote":"I have one bag of clothes, one backpack with a computer, iPad, and phone. I have zero other possessions.","note":"","created":1478558246},{"url":"http:\/\/nichol.as\/benchmark-of-python-web-servers","title":"Benchmark of Python WSGI servers","quote":"So that is what we are going to do, we are going to take the top-3 performing WSGI servers namely Tornado, Gevent and uWSGI (FAPWS3 lack of HTTP\/1.1 support made it unsuitable for this benchmark) and give them 5 minutes of ping-pong mayhem.","note":"","created":1478509745},{"url":"https:\/\/griffintechnology.com\/us\/breaksafe-magnetic-usb-c-power-cable","title":"BreakSafe magnetic USB-C power cable","quote":"Use BreakSafe with the USB-C power supply that came with your laptop. BreakSafe is rated up to 60 watts (20 volts @ 3 amps), and has been designed and tested to meet USB-C power standards. Please note that BreakSafe is for charging power only; data and video are not supported.","note":"","created":1477811141},{"url":"http:\/\/qz.com\/818998\/googles-former-happiness-guru-developed-a-three-second-brain-exercise-for-finding-joy\/","title":"Three-second brain exercise for finding joy","quote":"Tan’s thin slice exercise contains a trigger, a routine, and a reward—the three parts necessary to build a habit. The trigger, he says, is the pleasant moment, the routine is the noticing of it, and the reward is the feeling of joy itself.","note":"","created":1477589408},{"url":"https:\/\/www.amazon.com\/NOKIA-LUMIA-INCHES-FACTORY-UNLOCKED\/dp\/B00NOZLUDE\/","title":"Nokia Lumia 735","quote":"I can't express to you how nice and solid this phone feels in hand. It's nothing short of spectacular. I don't even use the case I have for it because I don't drop it without the case. I was at first a bit skeptical about build quality because the back cover is removable but the shape and materials look and feel amazing…","note":"This item ships to Romania.","created":1476818234},{"url":"https:\/\/kext.io\/2016\/10\/03\/a-base-filesystem-project\/","title":"A base filesystem project","quote":"I’ve pushed a basic remote macOS filesystem project to GitHub. Its got all the bits and pieces necessary to work but I haven’t audited all parts of it for correctness.","note":"I should build a SFTP file system too.","created":1476558622},{"url":"http:\/\/blog.etianen.com\/blog\/2013\/06\/08\/django-querysets","title":"Using Django querysets effectively","quote":"To avoid populating the queryset cache, but to still iterate over all your results, use the iterator() method to fetch the data in chunks, and throw away old rows when they’ve been processed.","note":"","created":1476518064},{"url":"http:\/\/www.nytimes.com\/2016\/10\/06\/t-magazine\/design\/brutalist-architecture-revival.html","title":"Brutalism is back","quote":"Brutalism was an attempt to create an architectural ethic, rather than an aesthetic. It had less to do with materials and more to do with honesty: an uncompromising desire to tell it like it is, architecturally speaking.","note":"","created":1476517679},{"url":"https:\/\/jamielinux.com\/blog\/hide-grub-menu-on-fedora\/","title":"Hide GRUB menu on Fedora","quote":"GRUB_TIMEOUT=0","note":"GRUB_HIDDEN_TIMEOUT=1","created":1476449146}]